{
  "company": "Jarvis Consulting Group",
  "role": "Junior Data Engineer/Developer (Trainees)",
  "location": "Greater Toronto Area, Canada",
  "posting_url": "https://ca.linkedin.com/jobs/view/junior-data-engineer-developer-trainees-at-jarvis-consulting-group-4371054978",
  "match_pct": 40,
  "status": "Discovered",
  "fit_points": [],
  "job_id": "20260211_Jarvis_Consulting_Group_Junior_Data_EngineerDeveloper_Trainees",
  "date_found": "2026-02-11",
  "posting_date": "2026-02-09",
  "description": "Jarvis is hiring for our Talent Incubation Program! Please note that these are entry-level roles, be sure to through the information below before applying. Jarvis is driven by a bold vision to transform the professional services landscape by setting a new standard for innovation, empowerment, and impactful solutions in data, AI, and technology. Our unwavering dedication is rooted in propelling businesses toward sustained success while making a positive impact on communities. Strategically operating from Toronto and Montreal, Europe, and North Africa, Jarvis extends its services across Canada and the US. Our diverse team comprises expert advisors and forward-thinking technologists who work tirelessly to unlock the full potential of businesses, ensuring the consistent delivery of exceptional results. The Jarvis Talent Incubation Program Training: Begin with an intensive, cost-free training program led by industry experts. You'll work on practical projects and gain proficiency in cutting-edge technologies, all while learning to apply them to solve business problems. Placement: Upon successful completion of the training, we place our graduates on a two-year contract with our prominent clients—some of the top companies in Canada. You'll be integrated into client teams, applying your skills to deliver tangible results. Continuous Support: Your journey doesn't end after training. We provide dedicated career support, mentorship, and opportunities to acquire industry-recognized certifications throughout your placement. You'll learn to navigate client environments, manage projects, and communicate effectively. Empowerment: We focus on developing both your technical and soft skills, ensuring you’re a well-rounded professional who can not only write code but also collaborate, lead, and innovate as a consultant. Your Role as a Tech Consultant Designing and developing high-quality software, data, and AI systems to meet client business needs. Collaborating with a team to analyze c",
  "key_words": ""
}